book = {"Polina": {"adress": "Belarus", "number": "80293456789", "data": "06.04.2008"},
        "Ksusha": {"adress": "Gomel", "number": "80449870064", "data": "22.11.2008"}}
#Переменная для операций  
n = 0 
#Вывод книги                                                             
print('Книга: ', book)
#Цикл
while n < 5:                                                  
#Выбор операций
    n = int(input('1-Удалить запись, 2-Изменить адрес, 3- Изменить номер телефона, 4-Посмотреть словарь: '))
#В случае если n=...
    match n:
        
#1 операция
        case 1: 
# Имя удаляемого      
            a = str(input('Кого хотите удалить? ')) 
#Нахождение элемента
            if a in book:  
#Удалить из словаря
                del book[a]
#Вывод действия
                print("Данные удалены")
#Иначе
            else:
#Вывод ошибки
                print("Ошибка: такого человека и так нет в базе")
        case 2:
            b = str(input("Чей адресс вы хотите изменить?")) 
            if b in book:
                c = str(input("Какой его новый адрес? "))
                book[b]["adress"] = c
                #Вывод действия
                print('Адрес изменен')
            else:
#Вывод ошибки
                print("Ошибка: такого человека нет в базе")    
        case 3:
            d = str(input("Номер телефона кого вы хотите изменить?"))
            if d in book:
                e = str(input("Какой его новый номер телефона? "))
                book[d]["adress"]=e
                #Вывод действия
                print('Номер изменен')
            else:
            #Вывод ошибки
                print("Ошибка: такого человека нет в базе") 
        case 4:
        #Вывод словаря
            print (book)